Emacs.org
#+title: Runemacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Startup Performance
Check time that Emacs starts in. Also check garbage collections Emacs did at initialization.

#+begin_src emacs-lisp
  (defun rune/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                       (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'rune/display-startup-time)
#+end_src

* Package System Configuration
Configure package system.

** Archives Setup
Configure which package archives to use.

#+begin_src emacs-lisp

  (setq package-archives
        '(("melpa" . "https://melpa.org/packages/")
          ("elpa" . "https://elpa.gnu.org/packages/")
          ("nongnu" . "https://elpa.nongnu.org/nongnu/")
          ("org" . "https://orgmode.org/elpa/")))
          ;; ("nongnu" . "https://elpa.nongnu.org/nongnu/")
          ;; ("melpa-stable" . "https://stable.melpa.org/packages/")))
  ;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
  ;; and `package-pinned-packages`. Most users will not need or want to do this.
  ;;(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
#+end_src

** Straight.el
*** Download
#+begin_src emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src
** Use Package Configuration
Setup of =use-package=

#+begin_src emacs-lisp

  (straight-use-package 'use-package)

  (setq straight-use-package-by-default t)

  ;; (package-initialize)

  ;; (setq use-package-always-ensure t)
  ;; (unless (package-installed-p 'use-package)
  ;;   (package-refresh-contents)
  ;;   (package-install 'use-package))
  ;; (eval-when-compile (require 'use-package))
  ;; ;; (setq use-package-verbose t)
  ;; (setq use-package-always-defer t)
  ;; (setq package-native-compile t)
  ;; (setq comp-deferred-compilation t)

#+end_src

* Keep Folders Clean
Configure =no-littering= package to make Emacs don't leave backup files.

#+begin_src emacs-lisp

  ; NOTE: If you want to move everything out of the ~/.emacs.d folder
  ;; reliably, set `user-emacs-directory` before loading no-littering!
  ;(setq user-emacs-directory "~/.cache/emacs")

  (use-package no-littering)

  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src
* Ui Configuration

** Basic Ui Configuration
Basic setup ui setup.

#+begin_src emacs-lisp

  (defvar rune/default-font-size 180)
  (defvar rune/default-variable-font-size 180)
  (defvar rune/frame-transparency '(90 . 90))

  (setq custom-file (locate-user-emacs-file "custom-vars.el"))
  (load custom-file 'noerror 'nomessage)

  (setq inhibit-startup-message t)
  (setq use-dialog-box nil)

  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (tooltip-mode -1)
  (auto-revert-mode 1)
  (set-fringe-mode 10)
  (xterm-mouse-mode 1)
  (column-number-mode)
  (global-auto-revert-mode 1)

  (global-display-line-numbers-mode 1)

  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  vterm-mode-hook
                  shell-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))


#+end_src
** Icons
Configure =all-the-icons= package.

#+begin_src emacs-lisp
  (use-package all-the-icons
    :defer nil
    :if (display-graphic-p))
#+end_src
** Font Configuration

#+begin_src emacs-lisp
  (defun rune/configure-font-faces ()
    (set-frame-parameter (selected-frame) 'alpha rune/frame-transparency)
    (add-to-list 'default-frame-alist `(alpha . ,rune/frame-transparency))
    (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
    (add-to-list 'default-frame-alist '(fullscreen . maximized))

    (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :weight 'light :height rune/default-font-size)
    (set-face-attribute 'fixed-pitch nil :font "JetBrainsMono Nerd Font" :weight 'light :height  rune/default-font-size)

    (set-face-attribute 'variable-pitch nil :font "Iosevka Aile" :weight 'light :height 1.3))


  (if (daemonp)
      (add-hook 'after-make-frame-functions
                (lambda (frame)
                  (setq doom-modeline-icon t)
                  (with-selected-frame frame
                    (rune/configure-font-faces))))
    (rune/configure-font-faces))

#+end_src
** Rainbow-Delimiters
Config of =rainbow-delimiters= for easier development.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
** Doom-Modeline
=doom-modeline= config.

#+begin_src emacs-lisp
  (use-package doom-modeline
    :defer nil
    :demand t
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))
#+end_src
** Theme Configuration
#+begin_src emacs-lisp

  (use-package doom-themes
    :demand t
    :config
    (load-theme 'doom-palenight t))


#+end_src

* Key Bindings Configuration
** Evil
=evil= package (VIM emulation) configuration.

*** Evil hook

#+begin_src emacs-lisp
  (defun rune/evil-hook ()
    (dolist (mode '(custom-mode
                    eshell-mode
                    git-rebase-mode
                    erc-mode
                    circe-server-mode
                    circe-char-mode
                    circe-query-mode
                    term-mode
                    sauron-mode))
      (add-to-list 'evil-emacs-state-modes mode)))

#+end_src

*** Evil collection
=evil-collection= setup for mode specified keybindings.

#+begin_src emacs-lisp
  (use-package evil-collection
    :defer nil
    :after evil
    :config
    (evil-collection-init))
#+end_src

*** Evil NerdCommenter
Better commenting =evil-nerd-commenter=.

#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
    :after evil
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src
*** Evil
=evil= setup.

#+begin_src emacs-lisp

  (use-package evil
    :defer t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    ;;  :hook (evil-mode . rune/evil-hook)
    :config
    (evil-mode)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  ;; Little code to get mode indication in evil

  (evil-mode nil)
  (evil-mode t)

#+end_src
** General
Configuration of =general=.

  #+begin_src emacs-lisp

    (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

    (use-package general
      :demand
      :config
      ;; (general-evil-setup t)
      (general-create-definer rune/leader-keys
        :keymaps '(normal insert visual emacs)
        :prefix "SPC"
        :global-prefix "C-SPC")

      (rune/leader-keys
        "t"  '(:ignore t :which-key "toggles")
        "tt" '(counsel-load-theme :which-key "choose theme"))
      (rune/leader-keys
        "o"  '(:ignore t :which-key "org-mode")
        "oa" '(org-agenda :which-key "Org Agenda")))

#+end_src
* Helpful packages
Helpful packages like =ivy= or =counsel=.

