Emacs.org
** Corfu
*** Config
Configuration for =corfu= completion.

#+begin_src emacs-lisp
  (use-package corfu
    ;; Optional customizations
    :custom
    (corfu-cycle t)                 ; Allows cycling through candidates
    (corfu-auto t)                  ; Enable auto completion
    (corfu-auto-prefix 1)
    (corfu-auto-delay 0.0)
    (corfu-popupinfo-delay '(0.5 . 0.2))
    (corfu-preview-current 'insert) ; Do not preview current candidate
    (corfu-preselect-first nil)
    (corfu-on-exact-match nil)      ; Don't auto expand tempel snippets
    (tab-always-indent 'complete)

    ;; Optionally use TAB for cycling, default is `corfu-complete'.
    :bind (:map corfu-map
                ("M-SPC"      . corfu-insert-separator)
                ("TAB"        . corfu-complete)
                ([tab]        . corfu-complete)
                ("<up>"       . corfu-previous)
                ([up]         . corfu-previous)
                ("<down>"     . corfu-next)
                ([down]       . corfu-next)
                ("S-<return>" . corfu-insert)
                ("RET"        . nil))

    :init
    (global-corfu-mode)
    :config
    (add-hook 'eshell-mode-hook
              (lambda () (setq-local corfu-quit-at-boundary t
                                corfu-quit-no-match t
                                corfu-auto nil)
                (corfu-mode))))

  (corfu-mode 1)
#+end_src

*** Corfu Terminal
Simple =corfu= integration with terminal.

#+begin_src  emacs-lisp
  (use-package corfu-terminal
    :after corfu
    :load-path "lisp/corfu-terminal"
    :config
    (corfu-terminal-mode 1))
#+end_src
** Cape

#+begin_src emacs-lisp
  (use-package cape
    :defer 10
    :init
    ;; Add `completion-at-point-functions', used by `completion-at-point'.
    (add-to-list 'completion-at-point-functions #'cape-file)
    ;; (add-to-list 'completion-at-point-functions #'cape-dabbrev)
    :config
    ;; Silence then pcomplete capf, no errors or messages!
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-silent)

    ;; Ensure that pcomplete does not write to the buffer
    ;; and behaves as a pure `completion-at-point-function'.
    (advice-add 'pcomplete-completions-at-point :around #'cape-wrap-purify))
#+end_src

** Lsp Mode
*** LSP Support
LSP integration for Emacs.

#+begin_src emacs-lisp
  (use-package lsp-mode
  :defer 1
  :commands (lsp lsp-deferred)
  :init
  ;; (setenv "LSP_USE_PLISTS" "1")
  ;; Increase the amount of data emacs reads from processes
  ;; General lsp-mode settings
  (setq lsp-keymap-prefix "C-c l")
    ;; to enable the lenses
    ;; (add-hook 'lsp-mode-hook #'lsp-lens-mode)
    ;; (add-hook 'lsp-completion-mode-hook
    ;;           (lambda ()
    ;;             (setf (alist-get 'lsp-capf completion-category-defaults)
    ;;                   '((styles . (orderless flex))))))
    :config
    (lsp-enable-which-key-integration t)
    ;; (global-set-key "C-" )
    (use-package lsp-ui
    :after lsp
    :init
    (setq lsp-ui-sideline-show-code-actions t)
    (setq lsp-ui-sideline-show-diagnostics t)
    :commands lsp-ui-mode))
    
#+end_src emacs-lisp
*** Languages
LSP servers configurations.

**** Rust

#+begin_src emacs-lisp

  (use-package rust-mode
    :defer t
    :mode "\\.rs\\'"
    :hook (rust-mode . lsp-deferred)
    :config
    :init
    ;; scratchpad for rust
    (setq lsp-rust-clippy-preference "on")
    (use-package rust-playground
      :commands (rust-playground)))
#+end_src
**** Python

#+begin_src emacs-lisp

  (use-package lsp-pyright
    :defer t
    :hook (python-mode . (lambda ()
                           (require 'lsp-pyright)
                           (lsp-deferred))))  ; or lsp-deferred

#+end_src
**** C/C++

#+begin_src emacs-lisp
  (use-package ccls
    :defer t
    :hook ((c-mode c++-mode objc-mode cuda-mode) . (lambda () (require 'ccls) (lsp-deferred))))
#+end_src
**** Typescript

#+begin_src emacs-lisp

  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))

#+end_src
*** DAP Support
Basic support for DAP in Emacs.

#+begin_src emacs-lisp

  (use-package dap-mode
    :commands dap-debug
    :config
    (dap-ui-mode)

    ;; (require 'dap-codelldb)
    ;; (require 'dap-lldb)
    (require 'dap-gdb-lldb)
    (require 'dap-cpptools)

    ;; (dap-codelldb-setup)
    (dap-cpptools-setup)
    (dap-gdb-lldb-setup))
    ;;(require 'dap-codelldb)
    ;; installs .extension/vscode
    ;;(dap-codelldb-setup)
    ;;(dap-cpptools-setup))
    ;;:custom
    ;; (dap-auto-configure-features '(sessions locals breakpoints expressions repl controls tooltip))
    ;;(dap-lldb-debug-program `(,(expand-file-name "/opt/homebrew/opt/llvm/bin/lldb"))))
#+end_src
**** Languages
***** Rust
#+begin_src emacs-lisp
  (with-eval-after-load 'dap-mode
    (dap-register-debug-template
     "Rust::LLDB Run Configuration"
     (list :type "cppdbg"
           :request "launch"
           :name "Rust::Run"
           :MIMode "lldb"
           :miDebuggerPath "rust-lldb"
           :enviroment []
           :program "${workspaceFolder}/target/debug/${target}"
           :cwd "${workspaceFolder}"
           :console "external"
           :dap-compilation "cargo build"
           :dap-compilation-dir "${workspaceFolder}")))
#+end_src
* Terminal
Terminal integration for Emacs.

** term-mode
Terminal emulator writter in *Emacs Lisp*.

#+begin_src emacs-lisp

  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "zsh") ;; Change this to zsh, etc
    ;;(setq explicit-zsh-args '())         ;; Use 'explicit-<shell>-args for shell-specific args
    ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))
  
#+end_src

*** Better Terminal Collors
Better terminal colors in =term-mode=.

#+begin_src emacs-lisp

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src

** vterm
Terminal emulator written in native code.

#+begin_src emacs-lisp
  (use-package vterm
    :commands (vterm vterm-other-window)
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
    (setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
    (setq vterm-max-scrollback 10000))
#+end_src
** eshell
Shell written in Emacs Lisp. 

#+begin_src emacs-lisp

  (defun rune/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

    (use-package eshell-git-prompt
      :after eshell-)

    (use-package eshell
      :hook (eshell-first-time-mode . rune/configure-eshell)
      :config

      (with-eval-after-load 'esh-opt
        (setq eshell-destroy-buffer-when-process-dies t)
        (setq eshell-visual-commands '("htop" "zsh" "vim")))

      (eshell-git-prompt-use-theme 'multiline))

#+end_src
* File Management
** Dired
Builtin file manager in Emacs.

#+begin_src emacs-lisp

  (use-package dired-single
    :after dired)

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  (use-package dired-open
    :after dired
    :config
    ;; (add-to-list 'dired-open-functions #'dired-open-xdg t)
    (setq dired-open-extensions '(("png" . "feh")
                                  ("mkv" . "mpv"))))

  (use-package dired-hide-dotfiles
    :after evil-collection
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
                                "H" 'dired-hide-dotfiles-mode))

  (use-package dired
    :straight nil
    :defer 0
    :after evil-collection
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
                                "h" 'dired-single-up-directory
                                "l" 'dired-single-buffer))


#+end_src
* Buffer Management
Buffer management with =perspective=.

#+begin_src emacs-lisp
    (use-package perspective
      :demand t
      :custom
      (persp-initial-frame-name "Main")
      (persp-mode-prefix-key (kbd "C-x x"))
      :bind (("C-x k" . persp-kill-buffer*))
      :init
      (unless (equal persp-mode t)
        (persp-mode)))
#+end_src
* Fun
** Speed-type
Simple application for speed typing.

#+begin_src emacs-lisp
  (use-package speed-type
    :defer 1)
#+end_src
