Emacs.org
* ERC
#+begin_src emacs-lisp

  ;; (use-package erc
  ;;   :custom
  ;;   (erc-nick "HumanEntity"))

  ;;  (with-eval-after-load 'erc
  ;;    (load "~/.emacs.d/lisp/erc/erc-sasl.el")

  ;;    (require 'erc-sasl)
  ;;    (add-to-list 'erc-sasl-server-regexp-list "irc\\.libera\\.chat")

  ;;    ;; Redefine/Override the erc-login() function from the erc package, so that
  ;;    ;; it now uses SASL
  ;;    (defun erc-login ()
  ;;      "Perform user authentication at the IRC server. (PATCHED)"
  ;;      (erc-log (format "login: nick: %s, user: %s %s %s :%s"
  ;;                       (erc-current-nick)
  ;;                       (user-login-name)
  ;;                       (or erc-system-name (system-name))
  ;;                       erc-session-server
  ;;                       erc-session-user-full-name))
  ;;      (if erc-session-password
  ;;          (erc-server-send (format "PASS %s" erc-session-password))
  ;;        (message "Logging in without password"))
  ;;      (when (and (featurep 'erc-sasl) (erc-sasl-use-sasl-p))
  ;;        (erc-server-send "CAP REQ :sasl"))
  ;;      (erc-server-send (format "NICK %s" (erc-current-nick)))
  ;;      (erc-server-send
  ;;       (format "USER %s %s %s :%s"
  ;;               ;; hacked - S.B.
  ;;               (if erc-anonymous-login erc-email-userid (user-login-name))
  ;;               "0" "*"
  ;;               erc-session-user-full-name))
  ;;      (erc-update-mode-line)))

  ;;  (defun rune/erc-chat ()
  ;;    (erc-tls :server "irc.libera.chat" :port 6697 :nick "HumanEntity"
  ;;    :full-name "HumanEntity"
  ;;    :password "HuM@n@b1e"))
#+end_src
* Tabs
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode t)
  (setq-default tab-width 4) ; Assuming you want your tabs to be four spaces wide
#+end_src
* Dynamic tiling window management
#+begin_src emacs-lisp
  (use-package edwina
    :config
    (setq display-buffer-base-action '(display-buffer-below-selected))
    (edwina-mode 1))
#+end_src
* Spliting Configuration
Configuration for making Emacs prefer vertical splits.

#+begin_src emacs-lisp
;; 
;;   (defun split-window-sensibly-prefer-horizontal (&optional window)
;;   "Based on split-window-sensibly, but designed to prefer a horizontal split,
;;   i.e. windows tiled side-by-side."
;;     (let ((window (or window (selected-window))))
;;       (or (and (window-splittable-p window t)
;;            ;; Split window horizontally
;;            (with-selected-window window
;;              (split-window-right)))
;;       (and (window-splittable-p window)
;;            ;; Split window vertically
;;            (with-selected-window window
;;              (split-window-below)))
;;       (and
;;            ;; If WINDOW is the only usable window on its frame (it is
;;            ;; the only one or, not being the only one, all the other
;;            ;; ones are dedicated) and is not the minibuffer window, try
;;            ;; to split it horizontally disregarding the value of
;;            ;; `split-height-threshold'.
;;            (let ((frame (window-frame window)))
;;              (or
;;               (eq window (frame-root-window frame))
;;               (catch 'done
;;                 (walk-window-tree (lambda (w)
;;                                     (unless (or (eq w window)
;;                                                 (window-dedicated-p w))
;;                                       (throw 'done nil)))
;;                                   frame)
;;                 t)))
;;        (not (window-minibuffer-p window))
;;        (let ((split-width-threshold 0))
;;          (when (window-splittable-p window t)
;;            (with-selected-window window
;;              (split-window-right))))))))
;; 
;;   (defun split-window-really-sensibly (&optional window)
;;     (let ((window (or window (selected-window))))
;;       (if (> (window-total-width window) (* 2 (window-total-height window)))
;;           (with-selected-window window (split-window-sensibly-prefer-horizontal window))
;;         (with-selected-window window (split-window-sensibly window)))))
;; 
;;   (setq split-height-threshold 4
;;         split-width-threshold 40
;;         split-window-preferred-function 'split-window-really-sensibly)
#+end_src
